import requests

# user_info={'name':'letian','password':'123'}
json_data = {"course":"模拟电子技术基础","unit":"绪论测验题","problems":[{"caption":"某放大电路在负载开路时的输出电压为4V，接入3kW的负载电阻后，输出电压为3V。说明放大电路的输出电阻为。"},{"caption":"已知某信号源内阻为1kW，未接放大电路时测得信号源电压为10mV，接入放大电路后测得放大电路输入端口电压为8mV，说明放大电路的输入电阻为。"},{"caption":"已知某放大电路的最大不失真输出电压范围是－10V～＋10V，若放大电路的通带电压增益是40dB，则放大电路不失真放大时的输入电压范围是。"},{"caption":"信号不失真的放大在时域中表现为任何一点的幅值放大的程度完全相同。"},{"caption":"只要放大电路的传输特性曲线是线性的，就不会出现失真现象。"},{"caption":"用放大电路放大正弦波信号时，只有可能出现非线性失真，不可能出现频率失真。"},{"caption":"放大电路的增益只能保证在一定频率范围内与频率无关。"},{"caption":"同一个放大电路对不同信号源或带不同负载时，实际的放大能力常常是不同的。"},{"caption":"放大电路只有电压增益、电流增益、互阻增益和互导增益四种增益形式。"}]}
r = requests.post('http://localhost:80/search', json=json_data)

print(r.headers)
# print(r.text)
